** Python expression tree demo
:PROPERTIES:
:ID:       3d4f0c55-7f58-4050-b60c-0e42f0e81f6c
:END:
#+begin_src bash :results org
python3 expression_demo.py
#+end_src

#+RESULTS:
#+begin_example
 Base Metric as SQL 
SELECT
    region,
    AVG(sessions.session_duration) AS avg_duration
FROM sessions
GROUP BY region;

 Base Metric via Pandas 
  region  avg_duration
0   APAC          10.0
1     EU          25.0
2     NA          37.5

 Filtered Metric as SQL 
SELECT
    region,
    AVG(sessions.session_duration) AS avg_duration
FROM (SELECT * FROM sessions WHERE session_duration > 10)
GROUP BY region;

 Filtered Metric via Pandas 
  region  avg_duration
0     EU          25.0
1     NA          37.5
#+end_example


This script defines a tiny expression language (Dataset, Feature, Literal,
Average, GroupBy, Filter) plus a visitor interface. Two visitors walk the same
tree.

